Белгипрозем_2017/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Константы</name>
    </items>
    <items>
      <name>Задачи</name>
    </items>
    <items>
      <name>БизнесПроцессы</name>
    </items>
    <items>
      <name>РегистрыРасчета</name>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
    </items>
    <items>
      <name>ПланыВидовРасчета</name>
    </items>
    <items>
      <name>ПланыСчетов</name>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
    </items>
    <items>
      <name>Обработки</name>
    </items>
    <items>
      <name>Отчеты</name>
    </items>
    <items>
      <name>Справочники</name>
    </items>
    <items>
      <name>Роли</name>
    </items>
    <items>
      <name>РегистрыСведений</name>
    </items>
    <items>
      <name>РегистрыНакопления</name>
    </items>
    <items>
      <name>Подсистемы</name>
    </items>
    <items>
      <name>ПланыОбмена</name>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
    </items>
    <items>
      <name>Документы</name>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйСиноним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПустойСсылки</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъектаМетаданных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСсылка</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/РаботаВБезопасномРежимеСлужебныйПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
// Серверные процедуры и функции общего назначения:
// - Поддержка профилей безопасности
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Только для внутреннего использования.
//
Функция СлужебныйИОМ() Экспорт
	
	Возврат Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"ПолноеИмя", Метаданные.РегистрыСведений.РежимыПодключенияВнешнихМодулей.ПолноеИмя());
	
КонецФункции

Функция МассивРазделителей() Экспорт
	
	МассивРазделителей = Новый Массив;
	
	Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Если ОбщийРеквизит.РазделениеДанных = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять Тогда
			МассивРазделителей.Добавить(ОбщийРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРазделителей;
	
КонецФункции

#КонецОбласти
